### Environment: `planning-slack-bot`
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>

```terraform
aws_ecr_repository.planning_bot: Refreshing state... [id=planning-bot]
nomad_job.planning_bot: Refreshing state... [id=planning-bot]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # nomad_job.planning_bot has been changed
  ~ resource "nomad_job" "planning_bot" {
      ~ allocation_ids          = [
          - "3c4f0ff6-7e73-85a6-851b-eaeec912e746",
          + "5d392107-a967-4a6f-5595-441e7e03b07c",
        ]
        id                      = "planning-bot"
        name                    = "planning-bot"
      ~ task_groups             = [
          ~ {
              ~ task    = [
                  ~ {
                      ~ volume_mounts = null -> []
                        # (3 unchanged elements hidden)
                    },
                ]
              ~ volumes = null -> []
                # (3 unchanged elements hidden)
            },
        ]
        # (9 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.planning_bot will be created
  + resource "aws_route53_zone" "planning_bot" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "fistaszek.makimo.pl"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project"    = "PB"
          + "Repository" = "planning-slack-bot"
        }
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Struchu, Action: `pull_request`*